### Importing necessary libraries

In [42]:
import pandas as pd 
import numpy as np 
from sqlalchemy import create_engine 
!pip install psycopg2-binary 
from dotenv import load_dotenv
import os
import psycopg2
import uuid

Requirement already satisfied: psycopg2-binary in c:\users\user\anaconda3\lib\site-packages (2.9.10)

In [43]:
import uuid

### Importing Dataset

In [3]:
# Load dataset
Sales_intelligence = pd.read_csv(r'C:\Users\user\Desktop\Sales_intelligence\Sales_intelligence\Dataset\Raw dataset\Sales Dataset.csv')
Sales_intelligence.head()

,Order ID,Amount,Profit,Quantity,Category,Sub-Category,PaymentMode,Order Date,CustomerName,State,City,Year-Month
0,B-26776,9726,1275,5,Electronics,Electronic Games,UPI,2023-06-27,David Padilla,Florida,Miami,2023-06
1,B-26776,9726,1275,5,Electronics,Electronic Games,UPI,2024-12-27,Connor Morgan,Illinois,Chicago,2024-12
2,B-26776,9726,1275,5,Electronics,Electronic Games,UPI,2021-07-25,Robert Stone,New York,Buffalo,2021-07
3,B-26776,4975,1330,14,Electronics,Printers,UPI,2023-06-27,David Padilla,Florida,Miami,2023-06
4,B-26776,4975,1330,14,Electronics,Printers,UPI,2024-12-27,Connor Morgan,Illinois,Chicago,2024-12

### Data Cleaning and Transformation

In [4]:
# Check for missing values
Sales_intelligence.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1194 entries, 0 to 1193
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Order ID      1194 non-null   object
 1   Amount        1194 non-null   int64
 2   Profit        1194 non-null   int64
 3   Quantity      1194 non-null   int64
 4   Category      1194 non-null   object
 5   Sub-Category  1194 non-null   object
 6   PaymentMode   1194 non-null   object
 7   Order Date    1194 non-null   object
 8   CustomerName  1194 non-null   object
 9   State         1194 non-null   object
 10  City          1194 non-null   object
 11  Year-Month    1194 non-null   object
dtypes: int64(3), object(9)
memory usage: 112.1+ KB

In [5]:
# Split 'Year-Month' into 'Year' and 'Month'
Sales_intelligence[['Year', 'Month']] = Sales_intelligence['Year-Month'].str.split('-', expand=True)

# Drop the original 'Year-Month' column
Sales_intelligence.drop(columns=['Year-Month'], inplace=True)

# Convert to integer types
Sales_intelligence['Year'] = Sales_intelligence['Year'].astype(int)
Sales_intelligence['Month'] = Sales_intelligence['Month'].astype(int)

In [6]:
# Convert the 'Order Date' column to datetime
Sales_intelligence['Order Date'] = pd.to_datetime(Sales_intelligence['Order Date'], format='%Y-%m-%d')

In [7]:
# Convert the 'Amount' and 'Price' columns to floats types
Sales_intelligence["Amount"] = Sales_intelligence["Amount"].astype(float)
Sales_intelligence["Profit"] = Sales_intelligence["Profit"].astype(float)

In [ ]:
# Rename columns 
Sales_intelligence.rename(columns={
    'Order Date': 'Order_date',
    'Sub-Category': 'Sub_category',
    'PaymentMode': 'Payment_mode',
    'Order ID': 'Order_ID',
    'CustomerName': 'Customer_name'
}, inplace=True)

In [10]:
Sales_intelligence.head()
Sales_intelligence.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1194 entries, 0 to 1193
Data columns (total 13 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Order_ID       1194 non-null   object
 1   Amount         1194 non-null   float64
 2   Profit         1194 non-null   float64
 3   Quantity       1194 non-null   int64
 4   Category       1194 non-null   object
 5   Sub_category   1194 non-null   object
 6   Payment_mode   1194 non-null   object
 7   Order_date     1194 non-null   datetime64[ns]
 8   Customer_name  1194 non-null   object
 9   State          1194 non-null   object
 10  City           1194 non-null   object
 11  Year           1194 non-null   int32
 12  Month          1194 non-null   int32
dtypes: datetime64[ns](1), float64(2), int32(2), int64(1), object(7)
memory usage: 112.1+ KB

### Operational Database Tables (Normalized)
### Creating Tables

In [11]:
# Products Table
Products_df = Sales_intelligence[['Category', 'Sub_category']].copy().drop_duplicates().reset_index(drop=True)
# Assign a unique product_ID
Products_df['Product_ID'] = Products_df.index + 1 
Products_df = Products_df[['Product_ID', 'Category', 'Sub_category']]
Products_df.head()

   Product_ID         Category      Sub_category
0           1      Electronics  Electronic Games
1           2      Electronics          Printers
2           3  Office Supplies              Pens
3           4      Electronics           Laptops
4           5        Furniture            Tables

In [12]:
# Location Table
Locations_df = Sales_intelligence[['City', 'State']].copy().drop_duplicates().reset_index(drop=True)
# Assign a unique Location_ID
Locations_df['Location_ID'] = Locations_df.index + 1 
Locations_df = Locations_df[['Location_ID', 'City', 'State']]
Locations_df.head()

   Location_ID         City       State
0            1        Miami     Florida
1            2      Chicago    Illinois
2            3      Buffalo    New York
3            4      Orlando     Florida
4            5  Los Angeles  California

In [13]:
# Customers Table
Customers_df = Sales_intelligence[['Customer_name', 'City', 'State']].drop_duplicates().reset_index(drop=True)
Customers_df = Customers_df.merge(Locations_df[['Location_ID', 'City', 'State']], on=['City', 'State'], how='left')
Customers_df['Customer_ID'] = Customers_df.index + 1
Customers_df = Customers_df[['Customer_ID', 'Customer_name', 'Location_ID']]
Customers_df.head()

   Customer_ID  Customer_name  Location_ID
0            1  David Padilla            1
1            2  Connor Morgan            2
2            3   Robert Stone            3
3            4    John Fields            4
4            5  Clayton Smith            1

In [14]:
# Payments Table
Payments_df = Sales_intelligence[['Payment_mode']].drop_duplicates().reset_index(drop=True)
Payments_df['Payment_ID'] = Payments_df.index + 1
Payments_df = Payments_df[['Payment_ID', 'Payment_mode']]
Payments_df.head()

   Payment_ID Payment_mode
0           1          UPI
1           2   Debit Card
2           3          EMI
3           4  Credit Card
4           5          COD

In [15]:
# Orders Table
# Merge all Pimary_IDs
Orders_df = Sales_intelligence.copy()
Orders_df = Orders_df.merge(Customers_df, on='Customer_name', how='left')
Orders_df = Orders_df.merge(Products_df, on=['Category', 'Sub_category'], how='left')
Orders_df = Orders_df.merge(Payments_df, on='Payment_mode', how='left')

# Final structure
Orders_df = Orders_df[['Order_ID', 'Customer_ID', 'Product_ID', 'Payment_ID', 
                        'Location_ID', 'Order_date', 'Quantity', 'Amount', 'Profit']].drop_duplicates().reset_index(drop=True)
Orders_df.head()

,Order_ID,Customer_ID,Product_ID,Payment_ID,Location_ID,Order_date,Quantity,Amount,Profit
0,B-26776,1,1,1,1,2023-06-27,5,9726.0,1275.0
1,B-26776,2,1,1,2,2024-12-27,5,9726.0,1275.0
2,B-26776,3,1,1,3,2021-07-25,5,9726.0,1275.0
3,B-26776,1,2,1,1,2023-06-27,14,4975.0,1330.0
4,B-26776,2,2,1,2,2024-12-27,14,4975.0,1330.0

### Save Tables to CSV

In [26]:
os.makedirs(r'C:\Users\user\Desktop\Sales_intelligence\Sales_intelligence\Dataset\Clean dataset', exist_ok=True)

In [27]:
Products_df.to_csv(r'C:\Users\user\Desktop\Sales_intelligence\Sales_intelligence\Dataset\Clean dataset\Products.csv', index=False)
Locations_df.to_csv(r'C:\Users\user\Desktop\Sales_intelligence\Sales_intelligence\Dataset\Clean dataset\Locations.csv', index=False)
Customers_df.to_csv(r'C:\Users\user\Desktop\Sales_intelligence\Sales_intelligence\Dataset\Clean dataset\Customers.csv', index=False)
Payments_df.to_csv(r'C:\Users\user\Desktop\Sales_intelligence\Sales_intelligence\Dataset\Clean dataset\Payments.csv', index=False)
Orders_df.to_csv(r'C:\Users\user\Desktop\Sales_intelligence\Sales_intelligence\Dataset\Clean dataset\Orders.csv', index=False)

### Data Warehouse Tables (Star Schema)
### DIMENSION TABLES

In [16]:
# Dim_Customer

dim_customer = Customers_df[['Customer_ID', 'Customer_name']].drop_duplicates().reset_index(drop=True)
dim_customer.head()

   Customer_ID  Customer_name
0            1  David Padilla
1            2  Connor Morgan
2            3   Robert Stone
3            4    John Fields
4            5  Clayton Smith

In [17]:
# dim_product
dim_product = Products_df[['Product_ID', 'Category', 'Sub_category']].drop_duplicates().reset_index(drop=True)
dim_product.head()

   Product_ID         Category      Sub_category
0           1      Electronics  Electronic Games
1           2      Electronics          Printers
2           3  Office Supplies              Pens
3           4      Electronics           Laptops
4           5        Furniture            Tables

In [18]:
# Dim_Location
dim_location = Locations_df[['Location_ID', 'City', 'State']].drop_duplicates().reset_index(drop=True)
dim_location.head()

   Location_ID         City       State
0            1        Miami     Florida
1            2      Chicago    Illinois
2            3      Buffalo    New York
3            4      Orlando     Florida
4            5  Los Angeles  California

In [22]:
# Dim_Payment
dim_payment = Payments_df[['Payment_ID', 'Payment_mode']].drop_duplicates().reset_index(drop=True)
dim_payment.head()

   Payment_ID Payment_mode
0           1          UPI
1           2   Debit Card
2           3          EMI
3           4  Credit Card
4           5          COD

In [ ]:
#  Dim_Date table
dim_date = Sales_intelligence[['Order_date']].drop_duplicates().reset_index(drop=True)
dim_date['Date_ID'] = dim_date.index + 1
dim_date['Year'] = dim_date['Order_date'].dt.year
dim_date['Month'] = dim_date['Order_date'].dt.month
dim_date.head()

  Order_date  Date_ID  Year  Month
0 2023-06-27        1  2023      6
1 2024-12-27        2  2024     12
2 2021-07-25        3  2021      7
3 2024-05-11        4  2024      5
4 2021-10-09        5  2021     10

In [ ]:
# Fact_Sales
Fact_Sales = Sales_intelligence.copy()
# Merge all Pimary_IDs
Fact_Sales = Fact_Sales.merge(Customers_df[['Customer_name', 'Customer_ID']], on='Customer_name', how='left')
Fact_Sales = Fact_Sales.merge(Products_df, on=['Category', 'Sub_category'], how='left')
Fact_Sales = Fact_Sales.merge(Payments_df, on='Payment_mode', how='left')
Fact_Sales = Fact_Sales.merge(Locations_df, on=['City', 'State'], how='left')
Fact_Sales = Fact_Sales.merge(dim_date, on='Order_date', how='left')


Fact_Sales = Fact_Sales[[
    'Order_ID', 'Date_ID', 'Customer_ID', 'Product_ID',
    'Location_ID', 'Payment_ID', 'Quantity', 'Amount', 'Profit'
]].drop_duplicates().reset_index(drop=True)
Fact_Sales.head()

,Order_ID,Date_ID,Customer_ID,Product_ID,Location_ID,Payment_ID,Quantity,Amount,Profit
0,B-26776,1,1,1,1,1,5,9726.0,1275.0
1,B-26776,2,2,1,2,1,5,9726.0,1275.0
2,B-26776,3,3,1,3,1,5,9726.0,1275.0
3,B-26776,1,1,2,1,1,14,4975.0,1330.0
4,B-26776,2,2,2,2,1,14,4975.0,1330.0

In [29]:
Fact_Sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1209 entries, 0 to 1208
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Order_ID     1209 non-null   object
 1   Date_ID      1209 non-null   int64
 2   Customer_ID  1209 non-null   int64
 3   Product_ID   1209 non-null   int64
 4   Location_ID  1209 non-null   int64
 5   Payment_ID   1209 non-null   int64
 6   Quantity     1209 non-null   int64
 7   Amount       1209 non-null   float64
 8   Profit       1209 non-null   float64
dtypes: float64(2), int64(6), object(1)
memory usage: 85.1+ KB

### Save Tabls to CSV

In [121]:
os.makedirs(r'C:\Users\user\Desktop\Sales_intelligence\Sales_intelligence\Dataset\Dimension Tables', exist_ok=True)


Dim_Product.to_csv(r'C:\Users\user\Desktop\Sales_intelligence\Sales_intelligence\Dataset\Dimension Tables\dim_product.csv', index=False)
Dim_Customer.to_csv(r'C:\Users\user\Desktop\Sales_intelligence\Sales_intelligence\Dataset\Dimension Tables\dim_customer.csv', index=False)
Dim_Date.to_csv(r'C:\Users\user\Desktop\Sales_intelligence\Sales_intelligence\Dataset\Dimension Tables\dim_date.csv', index=False)
Dim_Location.to_csv(r'C:\Users\user\Desktop\Sales_intelligence\Sales_intelligence\Dataset\Dimension Tables\dim_location.csv', index=False)
Dim_Payment.to_csv(r'C:\Users\user\Desktop\Sales_intelligence\Sales_intelligence\Dataset\Dimension Tables\dim_payment.csv', index=False)
Fact_Sales.to_csv(r'C:\Users\user\Desktop\Sales_intelligence\Sales_intelligence\Dataset\Dimension Tables\fact_sales.csv', index=False)

### Creating Tables on Postgres

In [30]:

import os
from dotenv import load_dotenv

load_dotenv(dotenv_path=r'C:\Users\user\Desktop\Sales_intelligence\Sales_intelligence\.env')

True

In [31]:
def get_db_connection():
    connection = psycopg2.connect(
        host = 'localhost',
        database = 'Sales_intelligence',
        port = '5432',
        user = 'postgres',
        password = os.getenv('PASSWORD')
    )
    return connection

In [32]:
conn = get_db_connection()

In [240]:
# Create SQL tables
def create_tables():
    conn = get_db_connection()
    cursor = conn.cursor()
    create_table_query = ''' 
                             CREATE SCHEMA IF NOT EXISTS Sales;
                             
                             DROP TABLE IF EXISTS Sales.Products CASCADE;
                             DROP TABLE IF EXISTS Sales.Locations CASCADE;
                             DROP TABLE IF EXISTS Sales.Payments CASCADE;
                             DROP TABLE IF EXISTS Sales.Customers CASCADE;
                             DROP TABLE IF EXISTS Sales.Orders CASCADE;
                             
                             CREATE TABLE IF NOT EXISTS Sales.Products(
                                Product_ID UUID PRIMARY KEY, 
                                Category TEXT NOT NULL,
                                Sub_category TEXT NOT NULL
                             );
                             
                             CREATE TABLE IF NOT EXISTS Sales.Locations(
                                Location_ID UUID PRIMARY KEY,
                                City TEXT NOT NULL,
                                State TEXT NOT NULL 
                               );
                               
                            CREATE TABLE IF NOT EXISTS Sales.Payments(
                                Payment_ID UUID PRIMARY KEY,
                                Payment_mode TEXT NOT NULL
                              ); 
                             
                             
                            CREATE TABLE IF NOT EXISTS Sales.Customers(
                               Customer_ID UUID PRIMARY KEY, 
                               Customer_name TEXT NOT NULL,
                               Location_ID UUID, 
                               FOREIGN KEY (Location_ID) REFERENCES Sales.Locations(Location_ID) 
                            );
                            
                            CREATE TABLE IF NOT EXISTS Sales.Orders(
                                Order_ID UUID PRIMARY KEY,
                                Customer_ID UUID,
                                Product_ID UUID,
                                Payment_ID UUID,
                                Location_ID UUID,
                                Order_date DATE NOT NULL,
                                Quantity INT NOT NULL,
                                Amount DECIMAL NOT NULL,
                                Profit DECIMAL NOT NULL,
                                FOREIGN KEY (Product_ID) REFERENCES Sales.Products(Product_ID),
                                FOREIGN KEY (Customer_ID) REFERENCES Sales.Customers(Customer_ID),
                                FOREIGN KEY (Payment_ID) REFERENCES Sales.Payments(Payment_ID),
                                FOREIGN KEY (Location_ID) REFERENCES Sales.Locations(Location_ID)
                            )
                            
    '''
    cursor.execute(create_table_query)
    conn.commit()
    cursor.close()
    conn.close()

In [214]:
create_tables()

In [63]:
def create_tables():
    conn = get_db_connection()
    cursor = conn.cursor()
    create_table_query = ''' 
        CREATE SCHEMA IF NOT EXISTS salesdw;

        DROP TABLE IF EXISTS salesdw.fact_sales CASCADE;
        DROP TABLE IF EXISTS salesdw.dim_customer CASCADE;
        DROP TABLE IF EXISTS salesdw.dim_product CASCADE;
        DROP TABLE IF EXISTS salesdw.dim_location CASCADE;
        DROP TABLE IF EXISTS salesdw.dim_payment CASCADE;
        DROP TABLE IF EXISTS salesdw.dim_date CASCADE;

        -- Dimension Tables

        CREATE TABLE salesdw.dim_customer (
            customer_id INTEGER PRIMARY KEY,
            customer_name TEXT NOT NULL
        );

        CREATE TABLE salesdw.dim_product (
            product_id INTEGER PRIMARY KEY,
            category TEXT NOT NULL,
            sub_category TEXT NOT NULL
        );

        CREATE TABLE salesdw.dim_location (
            location_id INTEGER PRIMARY KEY,
            city TEXT NOT NULL,
            state TEXT NOT NULL
        );

        CREATE TABLE salesdw.dim_payment (
            payment_id INTEGER PRIMARY KEY,
            payment_mode TEXT NOT NULL
        );

        CREATE TABLE salesdw.dim_date (
            date_id INTEGER PRIMARY KEY,
            order_date DATE NOT NULL,
            year INT NOT NULL,
            month INT NOT NULL 
        );

        CREATE TABLE salesdw.fact_sales (
            order_id INTEGER PRIMARY KEY,
            date_id INT,
            customer_id INTEGER,
            product_id INTEGER,
            location_id INTEGER,
            payment_id INTEGER,
            quantity INTEGER NOT NULL,
            amount DECIMAL NOT NULL,
            profit DECIMAL NOT NULL,
            FOREIGN KEY (date_id) REFERENCES salesdw.dim_date(date_id),
            FOREIGN KEY (customer_id) REFERENCES salesdw.dim_customer(customer_id),
            FOREIGN KEY (product_id) REFERENCES salesdw.dim_product(product_id),
            FOREIGN KEY (location_id) REFERENCES salesdw.dim_location(location_id),
            FOREIGN KEY (payment_id) REFERENCES salesDW.dim_payment(payment_id)
        );
    '''
    cursor.execute(create_table_query)
    conn.commit()
    cursor.close()
    conn.close()

In [47]:
create_tables()

### Loading Dataset

In [33]:
from sqlalchemy import create_engine

In [34]:

import os
from dotenv import load_dotenv

load_dotenv(dotenv_path=r'C:\Users\user\Desktop\Sales_intelligence\Sales_intelligence\.env')
password = os.getenv('PASSWORD')

In [35]:
engine = create_engine(f'postgresql+psycopg2://postgres:{password}@localhost:5432/Sales_intelligence')

In [67]:

# Load Products table
Products_df.to_sql(
    name='Products',
    con=engine,
    schema='sales',
    if_exists='append',
    index=False
)

12

In [239]:
# Load Customers table
Customers_df.to_sql(
    name='Customers',
    con=engine,
    schema='sales',
    if_exists='append',
    index=False
)

807

In [238]:
# Load Locations table
Locations_df.to_sql(
    name='Locations',
    con=engine,
    schema='sales',
    if_exists='append',
    index=False
)

18

In [237]:
# Load Payments table
Payments_df.to_sql(
    name='Payments',
    con=engine,
    schema='sales',
    if_exists='append',
    index=False
)

5

In [236]:
# Load Orders table
Orders_df.to_sql(
    name='Orders',
    con=engine,
    schema='sales',
    if_exists='append',
    index=False
)

209

In [49]:
# Load Dim_Customer
dim_customer.to_sql(
    name='dim_customer',
    con=engine,
    schema='salesdw',
    if_exists='append',
    index=False
)

807

In [52]:
# Load Dim_Product
dim_product.to_sql(
    name='dim_product',
    con=engine,
    schema='salesdw',
    if_exists='append',
    index=False
)

12

In [54]:
# Load Dim_Location
dim_location.to_sql(
    name='dim_location',
    con=engine,
    schema='salesdw',
    if_exists='append',
    index=False
)

18

In [56]:
# Load Dim_Payment
dim_payment.to_sql(
    name='dim_payment',
    con=engine,
    schema='salesdw',
    if_exists='append',
    index=False
)

5

In [64]:
# Load Dim_Date
dim_date.to_sql(
    name='dim_date',
    con=engine,
    schema='salesdw',
    if_exists='append',
    index=False
)

648

In [65]:
Fact_Sales.columns

Index(['Order_ID', 'Date_ID', 'Customer_ID', 'Product_ID', 'Location_ID',
       'Payment_ID', 'Quantity', 'Amount', 'Profit'],
      dtype='object')

In [74]:
#Load Fact_Sales
Fact_Sales.to_sql(
    name='Fact_Sales',          
    con=engine,                 
    schema='salesdw',             
    if_exists='append',         
    index=False 
)

209